# FIXED
#
# Тема: Логический тип Bool. Условия if-else

# Задание 1: Проверьте, является ли число 7 положительным, и выведите сообщение "Число положительное" если да.



x = 7
if x > 0 and x % 7 == 0:
    print("Ne podoschlo")


number = 7
if number > 0:
    print("Число положительное")




# Задание 2: Проверьте, четное ли число 8, и выведите соответствующее сообщение: "Число четное" или "Число нечетное".




a = 8
b = 8.0
print(a == b)

a = 8
if a > 0:
    print("Число четное")


# Задание 3: Определите, является ли строка "Hello" пустой, и выведите соответствующее сообщение:
# "Строка пустая" или "Строка не пустая".




text = "Hello"
result = "Строка пустая"if text =="" else "Строка не пустая"
print(result)




# Задание 4: Определите, является ли температура выше 30 градусов. Если да, то выведете "Очень жарко",
# если нет, то "Не очень жарко".
# temperature = 25



is_raining = bool(input('Wwedite\n1, esli Очень жарко ili \n0 esli Не очень жарко:'))
temperature = float(input('Wwedite temperaturu:'))

if is_raining or temperature < 30:
    print('Не очень жарко')
else:
    print('Pora guljatj')

if is_raining or temperature > 25:
    print('Очень жарко')
else:
    print('Ne wihodi na ulizu')




temperature = 25
if temperature > 30:
    print('Очень жарко')
else:
    print('Не очень жарко')




# Задание 5: Проверьте, начинается ли строка с заглавной буквы. Если да, то выведите длину строки.



text = "Hello"
if text[0].isupper():
    print(len(text))



# Задание 6: Определите, делится ли число на 5 без остатка.
# Если делится, то умножьте его на два, если нет, то прибавьте к числу 5.
# num = 20



print(20 / 5)
print(20 * 2)

print(4 * 2)
print(20 * 2)





# Задание 7: Определите, является ли число отрицательным, нулем или положительным.
# Выведите соответствующее сообщение: "Число положительное", "Число отрицательное", "Число равно нулю".




x = int(input('Wwedite  zislo:'))
if x > 0 and x % 4 == 0:
    print('"Число положительное"' )
else:
    print("Ne podoschlo pod uslowie")


x = int(input('Wwedite  zislo:'))
if x < 0 and x % -5 == 0:
    print('"Число отрицательное"')
else:
    print("Ne podoschlo pod uslowie")


x = int(input('Wwedite  zislo:'))
if x > 0 and x % 0 == 0:
    print('"Число равно нулю"')
else:
    print("Ne podoschlo pod uslowie")






# Тема: Вложенные условия и множественный выбор. Тернарный оператор

# Задание 1: Определите, принадлежит ли число 14 интервалу от 10 до 20 включительно.
# Выведите соответствующее сообщение: "Число принадлежит интервалу от 10 до 20", "Число больше 20", "Число меньше 10".




x = 14
if x >= 10:
    print("Число меньше 10")
if x <= 20:
    print("Число больше 20")
    print("Число принадлежит интервалу от 10 до 20")




# Задание 2: Проверьте, является ли строка пустой или начинается с пробела.
# Выведите соответствующее сообщение: "Строка пустая", "Строка начинается с пробела", "Строка не начинается с пробела".
# text = " example"


text = " example"
print("Строка начинается с пробела")

text = " example"
result = "Строка пустая"if text =="" else "Строка не пустая"
print(result)



# Задание 3: Определите размер скидки и выведите ее размер в консоль.
# Если покупка стоит до 10 долларов, то скидки нет, если до 50, то скидка 10%, если больше 50, то 15%.
# my_sum = 68




my_sum = 68
if my_sum < 10:
    print("скидки нет")
elif my_sum < 50:
    print("скидка 10%")
else:
    print("скидка 15%")




# Задание 4: Проверьте длину пароля и выведите соответствующее сообщение:
# до 8 символов "Короткий пароль", до 16 символов "Средний пароль", больше "Длинный пароль"
# password = "Привет"




passwort = "Priwet"
if len(passwort) <= 8:
   print("Priwet" <= "Priwetik")
   print("Короткий пароль")
elif len(passwort) <= 16:
    print("Priwetstwujte" >= "Priwetik" )
    print("Средний пароль")
else:
    print("Длинный пароль")



# Задание 5: Проверьте, содержит ли строка символ '@'.
# Если да, то выведите сообщение "Это email", если нет, то "Введите email".
# Проверить наличие символа в строке можно так: <символ> in <строка>



my_str = 'Maxim Skorpion@gmail.com'
if '@' in my_str:
    print("Это email")
else:
    print("Введите email")




# Задание 6: Определите, является ли число положительным или отрицательным с помощью тернарного оператора.
# num = -10



a = -10
if a > 0:
    print("a больше 0")
else:
    print("a не больше 0")




# Задание 7: Проверьте, четное или нечетное число с помощью тернарного оператора.
# num = 7



a = 7
if a < 0:
    print("a bolsche nulja")
if a == 7:
    print("a rowno semi")


num = 7
print("Четное" if num % 2 == 0 else "Нечетное")


# Задание 8: Определите, является ли строка пустой или нет с помощью тернарного оператора.
# text = "Hello"



text = "Hello"
result = "Строка пустая"if text =="" else "Строка не пустая"
print(result)


string = "Hello"
str_for_slice = "Hello"
sixth_cht = str_for_slice[5]

is_raining = bool(input('Определит\n1,является ли строка пустой или\n0 нет'))
if is_raining or ("Hello"):
    print('не является строка пустой')
else:
    print('является строка пустой')

string = 'Hello'
print(id(string))
print(string)





# Задание 9: Проверьте, начинается ли строка с заглавной буквы с помощью тернарного оператора.

# city = "Berlin"



city = "Berlin"
print(city[0].isupper())


print("berlin" == "Berlin") # False
print("berlin" != "Berlin") # True


str1 ="Berlin"
print(str1.find('B'))
print(str1.replace("berlin","Berlin"))





# Тема: Логические операторы: and, or, not

# Мини проект: Калькулятор
# Создайте простой калькулятор, который может выполнять основные арифметические операции:
# сложение, вычитание, умножение и деление.
#
# Требования:
# Программа должна запрашивать у пользователя два числа и операцию (+, -, *, /).
# Программа должна выполнять выбранную операцию и выводить результат, например: "Результат вычисления 2 + 3 равен 5"
# В противном случае вывести сообщение: "Ввод не может быть обработан".



num1 = float(input("Введите первое число: "))
num2 = float(input("Введите второе число: "))
sign = input("Введите знак операции (+, -, *, /): ")
if sign not in ['+', '-', '*', '/']:
    print("Ввод не может быть обработан")
else:
    print(f'Результат вычисления {num1} {sign} {num2} равен', eval(f'{num1} {sign} {num2}'))





try:
    num1 = float(input("Введите первое число: "))
    num2 = float(input("Введите второе число: "))



    "Запрашиваем"
    operation = input("Введите операцию (+, -, *, /): ")

    "Выполняем"
    if operation == "+":
        result = num1 + num2
        print(f" вычисления {num1} + {num2} равен {result}")
    elif operation == "-":
        result = num1 - num2
        print(f" вычисления {num1} - {num2} равен {result}")
    elif operation == "*":
        result = num1 * num2
        print(f"вычисления {num1} * {num2} равен {result}")
    elif operation == "/":
        if num2 != 0:
            result = num1 / num2
            print(f" вычисления {num1} / {num2} равен {result}")
        else:
            print("Ошибка: деление - на ноль!")
    else:
        print("не обработан. Некорректная операция.")
except ValueError:
    print("Ошибка:некорректные числа.")