tasks = []

while True:
# В решении используется цикл, чтобы программа работала пока вы ее принудительно не завершите через Ctr-C.
# Циклы вы еще не проходили. Для решения задачи эти знания не нужны. Просто пишите код с отступом, продолжая программу.
    print("\nСистема управления задачами")
    print("1. Добавить задачу")
    print("2. Показать задачи")
    print("3. Отметить задачу как выполненную")
    print("4. Удалить задачу")
    choice = input("Выберите действие, введя его номер: ")

    # Продолжите программу ниже. Код пишите с отсутпом, как принты выше.



