# У вас есть словарь, содержащий информацию о сотрудниках компании.
# Необходимо провести различные операции с этими данными.
#
# Задание:
# 1. Выведите имена всех сотрудников.
# 2. Найдите и выведите общую сумму зарплат всех сотрудников.
# 3. Добавьте нового сотрудника "David" с возрастом 28, отделом "IT" и зарплатой 6500.
# 4. Обновите зарплату "Alice" до 5500.
# 5. Удалите сотрудника "Charlie".
# 6. Выведите данные о каждом сотруднике в формате:
# "Имя: {name}, Возраст: {age}, Отдел: {department}, Зарплата: {salary}"
#
employees = {
    "Alice": {"age": 30, "department": "HR", "salary": 5000},
    "Bob": {"age": 25, "department": "IT", "salary": 6000},
    "Charlie": {"age": 35, "department": "Finance", "salary": 7000}
}
print("----------------------")
print("Список сотрудников:")
for name in employees:
    print(f"{name}")
print("----------------------")
summa = sum(employee["salary"] for employee in employees.values())
print(f"Общая зарплата сотрудников: {summa}")
print("----------------------")
print("Добавляем нового сотрудника:")
employees["David"] = {"age": 28, "department": "IT", "salary": 6500}
for name in employees:
    print(f"{name}")
