import math_operations

# Часть 2: Использование модуля
#
# 1. Создайте другой файл с именем `main.py`.
# 2. Импортируйте в этот файл созданный вами модуль `math_operations`.
# 3. Используйте функции из модуля для выполнения операций умножения, вычитания и деления,
# и выведите результаты на экран.

a, b = 21, 5

print(math_operations.divide(a, b))
print(math_operations.multiply(a, b))
print(math_operations.subtract(a, b))